module.exports = {
    messages: {
        verifyPromptGroup: (username) => `Herzlich Willkommen, ${username ? `@${username}` : 'newcomer'}! Доведіть, що ви людина, щоб приєднатися до бесіди: ${process.env.BOT_URL}.`,
        maxAttemptReached: "Ви досягли максимальної кількості спроб. Bitte versuchen пізніше.",
        welcome: "Ласкаво просимо! Введіть правильну числову відповідь, щоб продовжити:\n",
        incorrectResponse: "Falsche Antwort. Спробуйте ще раз: ",
        verificationComplete: "Верифікація успішна. Herzlich willkommen!",
        verificationError: "От халепа, щось пішло не так. Спробуємо ще раз...",
        copyPasteFromCache: "Ось повідомлення, які ви намагалися надіслати раніше. Ви можете скопіювати їх і вставити в чат:",
        banSpammersComplete: (spammers) => `✈️ Видалено ${spammers} ${spammers === 1 ? 'підозрілий акаунт' : 'підозрілих акаунтів'}. Побачили помилку? Зв'яжіться з ${process.env.BOT_URL} 🦘🦘🦘`,
        thanksMessage: "Danke sehr! Приємного спілкування!",
    },
    captchas: [
        { id: "1", question: "Який індекс має перший елемент масиву?", answer: "0" },
        { id: "2", question: "Що потрібно розбити, перш ніж можна буде використовувати?\n1. Двері\n2. Склянку\n3. Обіцянку", answer: "2" },
        { id: "3", question: "Чому програміст не може знайти любов?\n1. Він весь час дебажить\n2. Він думає, що всі відносини - це ітерації\n3. Він боїться комітів", answer: "3" },
        { id: "4", question: "Чому програмісти надають перевагу темному режиму?\n1. Легше для очей\n2. Вони вампіри\n3. Світло приваблює баги", answer: "3" },
        { id: "5", question: "Скільки значень може представляти тип boolean?", answer: "2" },
        { id: "6", question: "Яке найменше просте число?", answer: "2" },
        { id: "7", question: "Яка сума кутів трикутника (в градусах)?", answer: "180" },
        { id: "8", question: "Що буває раз за мить, двічі в момент, але ніколи за тисячу років?\n1. Комета\n2. Секунда\n3. Літера 'м'", answer: "3" },
        { id: "9", question: "Чому розробник залишився без грошей?\n1. Недостатньо коштів\n2. Витратив весь свій кеш\n3. Програв у парі", answer: "2" },
        { id: "10", question: "Який стандартний порт для HTTP?", answer: "80" }
    ]
};
